
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/88da6e56-6b2a-425e-9ae0-5a5c0e5aaf25/terraform-bin plan -no-color
2024-05-23T11:36:08.564Z [INFO]  Terraform version: 1.8.1
2024-05-23T11:36:08.564Z [INFO]  Go runtime version: go1.22.1
2024-05-23T11:36:08.564Z [INFO]  CLI args: []string{"/home/runner/work/_temp/88da6e56-6b2a-425e-9ae0-5a5c0e5aaf25/terraform-bin", "plan", "-no-color"}
2024-05-23T11:36:08.564Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-23T11:36:08.570Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=8720866b-51db-9d7b-d32d-05171b392f64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-23T11:36:09.321Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8720866b-51db-9d7b-d32d-05171b392f64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-23T11:36:09.501Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8720866b-51db-9d7b-d32d-05171b392f64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-23T11:36:09.867Z [INFO]  backend/local: starting Plan operation
2024-05-23T11:36:10.638Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=ef2a15e1-3966-1276-688f-3059316dc1d9 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-23T11:36:11.191Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T11:36:11.275Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:11.275Z
2024-05-23T11:36:11.929Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T11:36:11.938Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:11.938Z
2024-05-23T11:36:11.966Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T11:36:12.046Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.046Z
2024-05-23T11:36:12.070Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T11:36:12.081Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.081Z
2024-05-23T11:36:12.175Z [INFO]  backend/local: plan calling Plan
2024-05-23T11:36:12.178Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T11:36:12.256Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.256Z
2024-05-23T11:36:12.280Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T11:36:12.289Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.289Z
random_string.password: Refreshing state... [id=CYuk0fY8Djzc6J26]
2024-05-23T11:36:12.374Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: tf_req_id=144c8d04-4647-cd65-716c-cbd4cac7ef59 @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 timestamp=2024-05-23T11:36:12.374Z
2024-05-23T11:36:13.128Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=144c8d04-4647-cd65-716c-cbd4cac7ef59 @module=aws.aws-base timestamp=2024-05-23T11:36:13.128Z
aws_db_subnet_group.algosovled-subnet-group: Refreshing state... [id=algosolved-subnet-group]
data.aws_ami.ubuntu: Reading...
aws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]
aws_security_group.algosolved-rds-sg: Refreshing state... [id=sg-0229375002b3c6454]
aws_lb_target_group.algosolved-lb-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d]
aws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-09540795e7accd3a4]
2024-05-23T11:36:13.925Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ELBv2 Target Group arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d not found, removing from state
2024-05-23T11:36:13.925Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lb_target_group.algosolved-lb-tg during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:13.930Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute
      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute
      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute
      - .stickiness: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .target_failover: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .target_health_state: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .health_check[0].enabled: planned value cty.True for a non-computed attribute
      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute
2024-05-23T11:36:13.949Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] Security Group (sg-09540795e7accd3a4) not found, removing from state
2024-05-23T11:36:13.949Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_security_group.algosolved-ec2-sg during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:13.953Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
aws_lb.algosolved-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce]
2024-05-23T11:36:13.973Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ECR Repository (algosolved-ecr) not found, removing from state
2024-05-23T11:36:13.974Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:13.976Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-05-23T11:36:13.982Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
data.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]
aws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]
2024-05-23T11:36:14.447Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] EC2 Launch Template lt-040a43fee0df84a02 not found, removing from state
2024-05-23T11:36:14.448Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:14.456Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
aws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]
2024-05-23T11:36:14.772Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ELBv2 Load Balancer arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce not found, removing from state
2024-05-23T11:36:14.772Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lb.algosolved-lb during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:14.776Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_deletion_protection: planned value cty.False for a non-computed attribute
      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute
      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute
      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute
      - .enable_xff_client_port: planned value cty.False for a non-computed attribute
      - .preserve_host_header: planned value cty.False for a non-computed attribute
      - .security_groups: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute
      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute
      - .enable_http2: planned value cty.True for a non-computed attribute
      - .subnet_mapping: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
aws_alb_listener.algosolved-http-forward: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/17e7871c1b0acfce/97bb5a043b41ecb7]
2024-05-23T11:36:14.781Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-https-listener, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-23T11:36:14.878Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
2024-05-23T11:36:14.884Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .performance_insights_enabled: planned value cty.False for a non-computed attribute
      - .dedicated_log_volume: planned value cty.False for a non-computed attribute
      - .skip_final_snapshot: planned value cty.False for a non-computed attribute
      - .delete_automated_backups: planned value cty.True for a non-computed attribute
      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute
      - .apply_immediately: planned value cty.False for a non-computed attribute
      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute
      - .publicly_accessible: planned value cty.False for a non-computed attribute
2024-05-23T11:36:15.299Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] Auto Scaling Group algosolved-ec2-asg not found, removing from state
2024-05-23T11:36:15.300Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:15.314Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .target_group_arns: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-23T11:36:15.570Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ELBv2 Listener (arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/17e7871c1b0acfce/97bb5a043b41ecb7) not found, removing from state
2024-05-23T11:36:15.571Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_alb_listener.algosolved-http-forward during refresh.
      - Root object was present, but now absent
2024-05-23T11:36:15.575Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute
      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute
      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute
      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-23T11:36:15.598Z [INFO]  backend/local: plan operation completed

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_launch_template.algosolved-lt has been deleted
  - resource "aws_launch_template" "algosolved-lt" {
      - id                                   = "lt-040a43fee0df84a02" -> null
        name                                 = "algosolved-launch-template"
        tags                                 = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb.algosolved-lb has been deleted
  - resource "aws_lb" "algosolved-lb" {
      - arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce" -> null
        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce"
        name                                                         = "algosolved-alb"
        tags                                                         = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (25 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_lb_target_group.algosolved-lb-tg has been deleted
  - resource "aws_lb_target_group" "algosolved-lb-tg" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d" -> null
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d"
        name                               = "algosolved-ec2-target-group"
        tags                               = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.algosolved-ec2-sg has been deleted
  - resource "aws_security_group" "algosolved-ec2-sg" {
      - id                     = "sg-09540795e7accd3a4" -> null
        name                   = "algosolved-ec2-sgp"
        tags                   = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener.algosolved-http-forward will be created
  + resource "aws_alb_listener" "algosolved-http-forward" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all          = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.algosolved-https-listener will be created
  + resource "aws_alb_listener" "algosolved-https-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all          = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + timeouts {}
    }

  # aws_autoscaling_group.algosolved-ec2-asg will be created
  + resource "aws_autoscaling_group" "algosolved-ec2-asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "algosolved-ec2-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-02a53b7890c322346",
          + "subnet-048b8c0b0d0c912b2",
          + "subnet-05c85f1be65b09802",
          + "subnet-06c7c601881a79996",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "algosolved"
        }
      + tag {
          + key                 = "Stage"
          + propagate_at_launch = true
          + value               = "prod"
        }
    }

  # aws_db_instance.algosolved-rdb will be created
  + resource "aws_db_instance" "algosolved-rdb" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "algosolved"
      + db_subnet_group_name                  = "algosolved-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "algosolved-rdb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = [
          + "sg-0229375002b3c6454",
        ]
    }

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
    }

  # aws_launch_template.algosolved-lt will be created
  + resource "aws_launch_template" "algosolved-lt" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "This is ASG for Algosolved EC2 instances."
      + id                     = (known after apply)
      + image_id               = "ami-00dade17b7cbec931"
      + instance_type          = "t2.micro"
      + key_name               = "algosolved-ec2-key"
      + latest_version         = (known after apply)
      + name                   = "algosolved-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp3"
            }
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
    }

  # aws_lb.algosolved-lb will be created
  + resource "aws_lb" "algosolved-lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 120
      + internal                                                     = (known after apply)
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "algosolved-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-02a53b7890c322346",
          + "subnet-048b8c0b0d0c912b2",
          + "subnet-05c85f1be65b09802",
          + "subnet-06c7c601881a79996",
        ]
      + tags                                                         = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                                                     = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # aws_lb_target_group.algosolved-lb-tg will be created
  + resource "aws_lb_target_group" "algosolved-lb-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "15"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "algosolved-ec2-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                           = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0f87a26ea18c1b807"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/health/ping"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 10
        }
    }

  # aws_security_group.algosolved-ec2-sg will be created
  + resource "aws_security_group" "algosolved-ec2-sg" {
      + arn                    = (known after apply)
      + description            = "Algosolved EC2 Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow egress from all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "algosolved-ec2-sgp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                 = "vpc-0f87a26ea18c1b807"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: random_string.password: Refreshing state... [id=CYuk0fY8Djzc6J26]%0Aaws_db_subnet_group.algosovled-subnet-group: Refreshing state... [id=algosolved-subnet-group]%0Adata.aws_ami.ubuntu: Reading...%0Aaws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]%0Aaws_security_group.algosolved-rds-sg: Refreshing state... [id=sg-0229375002b3c6454]%0Aaws_lb_target_group.algosolved-lb-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d]%0Aaws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-09540795e7accd3a4]%0Aaws_lb.algosolved-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce]%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]%0Aaws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]%0Aaws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]%0Aaws_alb_listener.algosolved-http-forward: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/17e7871c1b0acfce/97bb5a043b41ecb7]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # aws_launch_template.algosolved-lt has been deleted%0A  - resource "aws_launch_template" "algosolved-lt" {%0A      - id                                   = "lt-040a43fee0df84a02" -> null%0A        name                                 = "algosolved-launch-template"%0A        tags                                 = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb.algosolved-lb has been deleted%0A  - resource "aws_lb" "algosolved-lb" {%0A      - arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce" -> null%0A        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce"%0A        name                                                         = "algosolved-alb"%0A        tags                                                         = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (25 unchanged attributes hidden)%0A%0A        # (7 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb_target_group.algosolved-lb-tg has been deleted%0A  - resource "aws_lb_target_group" "algosolved-lb-tg" {%0A      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d" -> null%0A        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d"%0A        name                               = "algosolved-ec2-target-group"%0A        tags                               = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_security_group.algosolved-ec2-sg has been deleted%0A  - resource "aws_security_group" "algosolved-ec2-sg" {%0A      - id                     = "sg-09540795e7accd3a4" -> null%0A        name                   = "algosolved-ec2-sgp"%0A        tags                   = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_alb_listener.algosolved-http-forward will be created%0A  + resource "aws_alb_listener" "algosolved-http-forward" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all          = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # aws_alb_listener.algosolved-https-listener will be created%0A  + resource "aws_alb_listener" "algosolved-https-listener" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"%0A      + tags              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all          = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # aws_autoscaling_group.algosolved-ec2-asg will be created%0A  + resource "aws_autoscaling_group" "algosolved-ec2-asg" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 0%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 3%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 0%0A      + name                             = "algosolved-ec2-asg"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = [%0A          + "subnet-02a53b7890c322346",%0A          + "subnet-048b8c0b0d0c912b2",%0A          + "subnet-05c85f1be65b09802",%0A          + "subnet-06c7c601881a79996",%0A        ]%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + tag {%0A          + key                 = "Project"%0A          + propagate_at_launch = true%0A          + value               = "algosolved"%0A        }%0A      + tag {%0A          + key                 = "Stage"%0A          + propagate_at_launch = true%0A          + value               = "prod"%0A        }%0A    }%0A%0A  # aws_db_instance.algosolved-rdb will be created%0A  + resource "aws_db_instance" "algosolved-rdb" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "algosolved"%0A      + db_subnet_group_name                  = "algosolved-subnet-group"%0A      + dedicated_log_volume                  = false%0A      + delete_automated_backups              = true%0A      + domain_fqdn                           = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "16"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "algosolved-rdb"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t4g.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = false%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags                                  = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "root"%0A      + vpc_security_group_ids                = [%0A          + "sg-0229375002b3c6454",%0A        ]%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A    }%0A%0A  # aws_launch_template.algosolved-lt will be created%0A  + resource "aws_launch_template" "algosolved-lt" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + description            = "This is ASG for Algosolved EC2 instances."%0A      + id                     = (known after apply)%0A      + image_id               = "ami-00dade17b7cbec931"%0A      + instance_type          = "t2.micro"%0A      + key_name               = "algosolved-ec2-key"%0A      + latest_version         = (known after apply)%0A      + name                   = "algosolved-launch-template"%0A      + name_prefix            = (known after apply)%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + block_device_mappings {%0A          + device_name = "/dev/xvda"%0A%0A          + ebs {%0A              + iops        = (known after apply)%0A              + throughput  = (known after apply)%0A              + volume_size = 50%0A              + volume_type = "gp3"%0A            }%0A        }%0A%0A      + tag_specifications {%0A          + resource_type = "instance"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "volume"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "network-interface"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A    }%0A%0A  # aws_lb.algosolved-lb will be created%0A  + resource "aws_lb" "algosolved-lb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 120%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = "ipv4"%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "algosolved-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = [%0A          + "subnet-02a53b7890c322346",%0A          + "subnet-048b8c0b0d0c912b2",%0A          + "subnet-05c85f1be65b09802",%0A          + "subnet-06c7c601881a79996",%0A        ]%0A      + tags                                                         = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                                                     = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # aws_lb_target_group.algosolved-lb-tg will be created%0A  + resource "aws_lb_target_group" "algosolved-lb-tg" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "15"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "algosolved-ec2-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                           = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0f87a26ea18c1b807"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/api/health/ping"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 10%0A          + unhealthy_threshold = 10%0A        }%0A    }%0A%0A  # aws_security_group.algosolved-ec2-sg will be created%0A  + resource "aws_security_group" "algosolved-ec2-sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Algosolved EC2 Security Group"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow egress from all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow ingress from all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = "algosolved-ec2-sgp"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                 = "vpc-0f87a26ea18c1b807"%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-23T11:36:08.564Z [INFO]  Terraform version: 1.8.1%0A2024-05-23T11:36:08.564Z [INFO]  Go runtime version: go1.22.1%0A2024-05-23T11:36:08.564Z [INFO]  CLI args: []string{"/home/runner/work/_temp/88da6e56-6b2a-425e-9ae0-5a5c0e5aaf25/terraform-bin", "plan", "-no-color"}%0A2024-05-23T11:36:08.564Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-23T11:36:08.570Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=8720866b-51db-9d7b-d32d-05171b392f64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-23T11:36:09.321Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8720866b-51db-9d7b-d32d-05171b392f64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-23T11:36:09.501Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8720866b-51db-9d7b-d32d-05171b392f64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-23T11:36:09.867Z [INFO]  backend/local: starting Plan operation%0A2024-05-23T11:36:10.638Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=ef2a15e1-3966-1276-688f-3059316dc1d9 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-23T11:36:11.191Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T11:36:11.275Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:11.275Z%0A2024-05-23T11:36:11.929Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T11:36:11.938Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:11.938Z%0A2024-05-23T11:36:11.966Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T11:36:12.046Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.046Z%0A2024-05-23T11:36:12.070Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T11:36:12.081Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.081Z%0A2024-05-23T11:36:12.175Z [INFO]  backend/local: plan calling Plan%0A2024-05-23T11:36:12.178Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T11:36:12.256Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.256Z%0A2024-05-23T11:36:12.280Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T11:36:12.289Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T11:36:12.289Z%0A2024-05-23T11:36:12.374Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: tf_req_id=144c8d04-4647-cd65-716c-cbd4cac7ef59 @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 timestamp=2024-05-23T11:36:12.374Z%0A2024-05-23T11:36:13.128Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=144c8d04-4647-cd65-716c-cbd4cac7ef59 @module=aws.aws-base timestamp=2024-05-23T11:36:13.128Z%0A2024-05-23T11:36:13.925Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ELBv2 Target Group arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/3b9d035eb5c40a2d not found, removing from state%0A2024-05-23T11:36:13.925Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lb_target_group.algosolved-lb-tg during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:13.930Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute%0A      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute%0A      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute%0A      - .stickiness: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .target_failover: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .target_health_state: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .health_check[0].enabled: planned value cty.True for a non-computed attribute%0A      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute%0A2024-05-23T11:36:13.949Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] Security Group (sg-09540795e7accd3a4) not found, removing from state%0A2024-05-23T11:36:13.949Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_security_group.algosolved-ec2-sg during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:13.953Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-23T11:36:13.973Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ECR Repository (algosolved-ecr) not found, removing from state%0A2024-05-23T11:36:13.974Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:13.976Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-05-23T11:36:13.982Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-23T11:36:14.447Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] EC2 Launch Template lt-040a43fee0df84a02 not found, removing from state%0A2024-05-23T11:36:14.448Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:14.456Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-23T11:36:14.772Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ELBv2 Load Balancer arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/17e7871c1b0acfce not found, removing from state%0A2024-05-23T11:36:14.772Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_lb.algosolved-lb during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:14.776Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .enable_deletion_protection: planned value cty.False for a non-computed attribute%0A      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute%0A      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute%0A      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute%0A      - .enable_xff_client_port: planned value cty.False for a non-computed attribute%0A      - .preserve_host_header: planned value cty.False for a non-computed attribute%0A      - .security_groups: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute%0A      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute%0A      - .enable_http2: planned value cty.True for a non-computed attribute%0A      - .subnet_mapping: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-23T11:36:14.781Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-https-listener, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-23T11:36:14.878Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute%0A2024-05-23T11:36:14.884Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .performance_insights_enabled: planned value cty.False for a non-computed attribute%0A      - .dedicated_log_volume: planned value cty.False for a non-computed attribute%0A      - .skip_final_snapshot: planned value cty.False for a non-computed attribute%0A      - .delete_automated_backups: planned value cty.True for a non-computed attribute%0A      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute%0A      - .apply_immediately: planned value cty.False for a non-computed attribute%0A      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute%0A      - .publicly_accessible: planned value cty.False for a non-computed attribute%0A2024-05-23T11:36:15.299Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] Auto Scaling Group algosolved-ec2-asg not found, removing from state%0A2024-05-23T11:36:15.300Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:15.314Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .target_group_arns: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-23T11:36:15.570Z [WARN]  provider.terraform-provider-aws_v5.49.0_x5: [WARN] ELBv2 Listener (arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/17e7871c1b0acfce/97bb5a043b41ecb7) not found, removing from state%0A2024-05-23T11:36:15.571Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_alb_listener.algosolved-http-forward during refresh.%0A      - Root object was present, but now absent%0A2024-05-23T11:36:15.575Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute%0A      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute%0A      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute%0A      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-23T11:36:15.598Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @youngjun0627**